
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	// Вставить содержимое обработчика.
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда 
		Фото = ПутьФайла;
		УстановитьКартинку();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку()
	НовыйФайлКартинки = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.Файл.Получить());
	НовыйФайлКартинки.Записать();
	Объект.Картинка = НовыйФайлКартинки.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Перем ТекстСообщения;
	ТекстСообщения = "";
	Если ПустаяСтрока(Объект.Название) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Название";
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстСообщения) Тогда 
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Объект.Наименование = Объект.Название;
КонецПроцедуры

&НаКлиенте
Процедура ТипТовараПриИзменении(Элемент)
	ТипТовараПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ТипТовараПриИзмененииНаСервере()
	Если Объект.ТипТовара = Перечисления.Тип.Питание Тогда
		ЭтаФорма.Элементы.СрокГодности.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.СрокГодности.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


