
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
	Перем ТекстСообщения;
	ТекстСообщения = "";
	Если ПустаяСтрока(Объект.Фамилия) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Фамилия";
	КонецЕсли;
	Если ПустаяСтрока(Объект.Имя) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Имя";
	КонецЕсли; 
	Если ПустаяСтрока(Объект.Отчество) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Отчество";
	КонецЕсли;
	Если Объект.Оклад = 0 Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле Оклад";
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстСообщения) Тогда 
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Объект.Наименование = Объект.Фамилия + " " + ВРег(Лев(Объект.Имя, 1)) + "." + ВРег(Лев(Объект.Отчество, 1)) +".";
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	// Вставить содержимое обработчика.
	ИмяФайла = "";
	ПутьФайла = "";
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда 
		Фото = ПутьФайла;
		УстановитьКартинку();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку()
	НовыйФайлКартинки = Справочники.Файлы.СоздатьЭлемент();
	НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото = ПоместитьВоВременноеХранилище(НовыйФайлКартинки.Файл.Получить());
	НовыйФайлКартинки.Записать();
	Объект.Картинка = НовыйФайлКартинки.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Фото = ПолучитьНавигационнуюСсылку(Объект.Картинка, "Файл");
	Элементы.Фото.РазмерКартинки = РазмерКартинки.АвтоРазмер;
КонецПроцедуры
